GoBed1/stm32H7-eth/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "board.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ETH_RST_Pin GPIO_PIN_0
#define ETH_RST_GPIO_Port GPIOC
#define LED1_Pin GPIO_PIN_9
#define LED1_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */
#ifndef LOG_LEVEL_NONE
#define LOG_LEVEL_NONE    0
#define LOG_LEVEL_ERROR   1
#define LOG_LEVEL_WARNING 2
#define LOG_LEVEL_INFO    3
#define LOG_LEVEL_DEBUG   4
#define LOG_LEVEL_VERBOSE 5
#endif
#define LOG_PRINTF(level,tag,...) logger_printf(level,tag,__VA_ARGS__)
#define LOG_PRINTF_LINE(level,tag,...) logger_printf_line(level,tag,__VA_ARGS__)
#define LOG_DEBUG(tag,...)    LOG_PRINTF(LOG_LEVEL_DEBUG,tag,__VA_ARGS__)
#define LOG_INFO(tag,...)     LOG_PRINTF(LOG_LEVEL_INFO,tag,__VA_ARGS__)
#define LOG_WARNING(tag,...)  LOG_PRINTF(LOG_LEVEL_WARNING,tag,__VA_ARGS__)
#define LOG_ERROR(tag,...)    LOG_PRINTF(LOG_LEVEL_ERROR,tag,__VA_ARGS__)
void check_stack_watermark(const char* task_name);
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
